remnorton/stm32_common/sp2lp/S2LP_Regs.h
#define FDEV_M_REGMASK			((uint8_t)0xFF)


/**
 * \brief CHFLT register
 * \code
 * Read and Write
 * Default value: 0x23
 * 7:4 CHFLT_M: The mantissa value of the receiver channel filter, default 100 kHz.
 * 3:0 CHFLT_E: The exponent value of the receiver channel filter, default 100 kHz.
 * \endcode
 */
#define CHFLT_ADDR			((uint8_t)0x13)

#define CHFLT_M_REGMASK			((uint8_t)0xF0)
#define CHFLT_E_REGMASK			((uint8_t)0x0F)


/**
 * \brief AFC2 register
 * \code
 * Read and Write
 * Default value: 0xC8
 * 7 AFC_FREEZE_ON_SYNC: 1: enable the freeze AFC correction upon sync word detection.
 * 6 AFC_ENABLED: 1: enable the AFC correction.
 * 5 AFC_MODE: Select AFC mode:,  0: AFC loop closed on slicer,  1: AFC loop closed on second conversion stage.
 * 4:0 RESERVED: -
 * \endcode
 */
#define AFC2_ADDR			((uint8_t)0x14)

#define AFC_FREEZE_ON_SYNC_REGMASK			((uint8_t)0x80)
#define AFC_ENABLED_REGMASK			((uint8_t)0x40)
#define AFC_MODE_REGMASK			((uint8_t)0x20)


/**
 * \brief AFC1 register
 * \code
 * Read and Write
 * Default value: 0x18
 * 7:0 AFC_FAST_PERIOD: The length of the AFC fast period.
 * \endcode
 */
#define AFC1_ADDR			((uint8_t)0x15)

#define AFC_FAST_PERIOD_REGMASK			((uint8_t)0xFF)


/**
 * \brief AFC0 register
 * \code
 * Read and Write
 * Default value: 0x25
 * 7:4 AFC_FAST_GAIN: The AFC loop gain in fast mode (2's log).
 * 3:0 AFC_SLOW_GAIN: The AFC loop gain in slow mode (2's log).
 * \endcode
 */
#define AFC0_ADDR			((uint8_t)0x16)

#define AFC_FAST_GAIN_REGMASK			((uint8_t)0xF0)
#define AFC_SLOW_GAIN_REGMASK			((uint8_t)0x0F)


/**
 * \brief RSSI_FLT register
 * \code
 * Read and Write
 * Default value: 0xE3
 * 7:4 RSSI_FLT: Gain of the RSSI filter.
 * 3:2 CS_MODE: Carrier sense mode:,  00b: Static CS,  01b: Dynamic CS with 6dB dynamic threshold,  10b: Dynamic CS with 12dB dynamic threshold,  11b: Dynamic CS with 18dB dynamic threshold.
 * 1:0 RESERVED: -
 * \endcode
 */
#define RSSI_FLT_ADDR			((uint8_t)0x17)
#define RSSI_FLT_REGMASK		((uint8_t)0xF0)
#define CS_MODE_REGMASK			((uint8_t)0x0C)


/**
 * \brief RSSI_TH register
 * \code
 * Read and Write
 * Default value: 0x28
 * 7:0 RSSI_TH: Signal detect threshold in 0.5 dB steps, default -120 dBm corresponds to 0x28.
 * \endcode
 */
#define RSSI_TH_ADDR			((uint8_t)0x18)

#define RSSI_TH_REGMASK			((uint8_t)0xFF)


/**
 * \brief ANT_SELECT_CONF register
 * \code
 * Read and Write
 * Default value: 0x45
 * 7 RESERVED: -
 * 6:5 EQU_CTRL: ISI cancellation equalizer:,  00: equalization disabled,  01: single pass equalization,  10: dual pass equalization.
 * 4 CS_BLANKING: Do not fill the RX FIFO with data if the CS is above threhold.
 * 3 AS_ENABLE: 1: enable the antenna switching.
 * 2:0 AS_MEAS_TIME: Set the measurement time.
 * \endcode
 */
#define ANT_SELECT_CONF_ADDR			((uint8_t)0x1F)

#define EQU_CTRL_REGMASK			((uint8_t)0x60)
#define CS_BLANKING_REGMASK			((uint8_t)0x10)
#define AS_ENABLE_REGMASK			((uint8_t)0x08)
#define AS_MEAS_TIME_REGMASK			((uint8_t)0x07)


/**
 * \brief CLOCKREC1 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:5 CLK_REC_P_GAIN_SLOW: Clock recovery slow loop gain (log2).
 * 4 CLK_REC_ALGO_SEL: Select the symbol timing recovery algorithm: 0: DLL, 1: PLL.
 * 3:0 CLK_REC_I_GAIN_SLOW: Set the integral slow gain for symbol timing recovery (PLL mode only).
 * \endcode
 */
#define CLOCKREC1_ADDR			((uint8_t)0x20)

#define CLK_REC_P_GAIN_SLOW_REGMASK			((uint8_t)0xE0)
#define CLK_REC_ALGO_SEL_REGMASK			((uint8_t)0x10)
#define CLK_REC_I_GAIN_SLOW_REGMASK			((uint8_t)0x0F)


/**
 * \brief CLOCKREC0 register
 * \code
 * Read and Write
 * Default value: 0x58
 * 7:5 CLK_REC_P_GAIN_FAST: Clock recovery fast loop gain (log2).
 * 4 PSTFLT_LEN: Select the post filter length: 0: 8 symbols, 1: 16 symbols.
 * 3:0 CLK_REC_I_GAIN_FAST: Set the integral fast gain for symbol timing recovery (PLL mode only)..
 * \endcode
 */
#define CLOCKREC0_ADDR			((uint8_t)0x21)

#define CLK_REC_P_GAIN_FAST_REGMASK			((uint8_t)0xE0)
#define PSTFLT_LEN_REGMASK			((uint8_t)0x10)
#define CLK_REC_I_GAIN_FAST_REGMASK			((uint8_t)0x0F)


/**
 * \brief PCKTCTRL6 register
 * \code
 * Read and Write
 * Default value: 0x80
 * 7:2 SYNC_LEN: The number of bits used for the SYNC field in the packet.
 * 1:0 PREAMBLE_LEN_9_8: The MSB of the number of '01 or '10' of the preamble of the packet.
 * \endcode
 */
#define PCKTCTRL6_ADDR			((uint8_t)0x2B)

#define SYNC_LEN_REGMASK			((uint8_t)0xFC)
#define PREAMBLE_LEN_9_8_REGMASK			((uint8_t)0x03)


/**
 * \brief PCKTCTRL5 register
 * \code
 * Read and Write
 * Default value: 0x10
 * 7:0 PREAMBLE_LEN[7:0]: The LSB of the number of '01 or '10' of the preamble of the packet.
 * \endcode
 */
#define PCKTCTRL5_ADDR			((uint8_t)0x2C)

#define PREAMBLE_LEN_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief PCKTCTRL4 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7 LEN_WID: The number of bytes used for the length field: 0: 1 byte, 1: 2 bytes.
 * 6:4 RESERVED: -
 * 3 ADDRESS_LEN: 1: include the ADDRESS field in the packet.
 * 2:0 RESERVED: -
 * \endcode
 */
#define PCKTCTRL4_ADDR			((uint8_t)0x2D)

#define LEN_WID_REGMASK			((uint8_t)0x80)
#define ADDRESS_LEN_REGMASK			((uint8_t)0x08)


/**
 * \brief PCKTCTRL3 register
 * \code
 * Read and Write
 * Default value: 0x20
 * 7:6 PCKT_FRMT: Format of packet:,  0: Basic,  2: WM-Bus,  3: STack
 * 5:4 RX_MODE: RX mode:,  0: normal mode,  1: direct through FIFO,  2: direct through GPIO
 * 3 FSK4_SYM_SWAP: Select the symbol mapping for 4(G)FSK.
 * 2 BYTE_SWAP: Select the transmission order between MSB and LSB.
 * 1:0 PREAMBLE_SEL: Select the preamble pattern between '10' and '01'.
 * \endcode
 */
#define PCKTCTRL3_ADDR			((uint8_t)0x2E)

#define PCKT_FRMT_REGMASK			((uint8_t)0xC0)
#define RX_MODE_REGMASK			((uint8_t)0x30)
#define FSK4_SYM_SWAP_REGMASK			((uint8_t)0x08)
#define BYTE_SWAP_REGMASK			((uint8_t)0x04)
#define PREAMBLE_SEL_REGMASK			((uint8_t)0x03)


/**
 * \brief PCKTCTRL2 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:6 RESERVED: -
 * 5 FCS_TYPE_4G: FCS type in header field of 802.15.4g packet.
 * 4 FEC_TYPE_4G: Select the FEC type of 802.15.4g packet: 0: NRNSC. 1: RSC.
 * 3 INT_EN_4G: 1: enable the interleaving of 802.15.4g packet.
 * 2 MBUS_3OF6_EN: 1: enable the 3-out-of-6 encoding/decoding.
 * 1 MANCHESTER_EN: 1: enable the Manchester encoding/decoding.
 * 0 FIX_VAR_LEN: Packet length mode:,  0: fixed,  1: variable (in variable mode the field LEN_WID of PCKTCTRL3 register must be configured)
 * \endcode
 */
#define PCKTCTRL2_ADDR			((uint8_t)0x2F)

#define FCS_TYPE_4G_REGMASK			((uint8_t)0x20)
#define FEC_TYPE_4G_REGMASK			((uint8_t)0x10)
#define INT_EN_4G_REGMASK			((uint8_t)0x08)
#define MBUS_3OF6_EN_REGMASK			((uint8_t)0x04)
#define MANCHESTER_EN_REGMASK			((uint8_t)0x02)
#define FIX_VAR_LEN_REGMASK			((uint8_t)0x01)


/**
 * \brief PCKTCTRL1 register
 * \code
 * Read and Write
 * Default value: 0x2C
 * 7:5 CRC_MODE: CRC field:,  0: no CRC field,  1: CRC using poly 0x07,  2: CRC using poly 0x8005,  3: CRC using poly 0x1021,  4: CRC using poly 0x864CBF
 * 4 WHIT_EN: 1: enable the whitening mode.
 * 3:2 TXSOURCE: Tx source data:,  0: normal mode,  1: direct through FIFO,  2: direct through GPIO,  3: PN9
 * 1 SECOND_SYNC_SEL: In TX mode: 0 select the primary SYNC word, 1 select the secondary SYNC word., In RX mode: enable the dual SYNC word detection mode.
 * 0 FEC_EN: 1: enable the FEC encoding in TX or the Viterbi decoding in RX.
 * \endcode
 */
#define PCKTCTRL1_ADDR			((uint8_t)0x30)

#define CRC_MODE_REGMASK		((uint8_t)0xE0)
#define WHIT_EN_REGMASK			((uint8_t)0x10)
#define TXSOURCE_REGMASK		((uint8_t)0x0C)
#define SECOND_SYNC_SEL_REGMASK	((uint8_t)0x02)
#define FEC_EN_REGMASK			((uint8_t)0x01)


/**
 * \brief PCKTLEN1 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 PCKTLEN1: MSB of length of packet in bytes.
 * \endcode
 */
#define PCKTLEN1_ADDR			((uint8_t)0x31)

