remnorton/stm32_common/sp2lp/S2LP_Regs.h
#define CRC_FIELD0_REGMASK			((uint8_t)0xFF)


/**
 * \brief RX_ADDRE_FIELD1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RX_ADDRE_FIELD1: Source address field of the received packet.
 * \endcode
 */
#define RX_ADDRE_FIELD1_ADDR			((uint8_t)0xAA)

#define RX_ADDRE_FIELD1_REGMASK			((uint8_t)0xFF)


/**
 * \brief RX_ADDRE_FIELD0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RX_ADDRE_FIELD0: Destination address field of the received packet.
 * \endcode
 */
#define RX_ADDRE_FIELD0_ADDR			((uint8_t)0xAB)

#define RX_ADDRE_FIELD0_REGMASK			((uint8_t)0xFF)


/**
 * \brief RSSI_LEVEL_RUN register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 RSSI_LEVEL_RUN: RSSI level of the received packet, which supports continuos fast SPI reading.
 * \endcode
 */
#define RSSI_LEVEL_RUN_ADDR			((uint8_t)0xEF)

#define RSSI_LEVEL_RUN_REGMASK			((uint8_t)0xFF)


/**
 * \brief DEVICE_INFO1 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 PARTNUM: S2-LP part number
 * \endcode
 */
#define DEVICE_INFO1_ADDR			((uint8_t)0xF0)

#define PARTNUM_REGMASK			((uint8_t)0xFF)


/**
 * \brief DEVICE_INFO0 register
 * \code
 * Read only
 * Default value: 0x41
 * 7:0 RSSI_LEVEL: S2-LP version number
 * \endcode
 */
#define DEVICE_INFO0_ADDR			((uint8_t)0xF1)

#define RSSI_LEVEL_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_STATUS3 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 INT_LEVEL[31:24]: Interrupt status register 3
 * \endcode
 */
#define IRQ_STATUS3_ADDR			((uint8_t)0xFA)

#define INT_LEVEL_31_24_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_STATUS2 register
 * \code
 * Read only
 * Default value: 0x09
 * 7:0 INT_LEVEL[23:16]: Interrupt status register 2
 * \endcode
 */
#define IRQ_STATUS2_ADDR			((uint8_t)0xFB)

#define INT_LEVEL_23_16_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_STATUS1 register
 * \code
 * Read only
 * Default value: 0x05
 * 7:0 INT_LEVEL[15:8]: Interrupt status register 1
 * \endcode
 */
#define IRQ_STATUS1_ADDR			((uint8_t)0xFC)

#define INT_LEVEL_15_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_STATUS0 register
 * \code
 * Read only
 * Default value: 0x00
 * 7:0 INT_LEVEL[7:0]: Interrupt status register 0
 * \endcode
 */
#define IRQ_STATUS0_ADDR			((uint8_t)0xFD)

#define INT_LEVEL_7_0_REGMASK			((uint8_t)0xFF)


/******************* (C) COPYRIGHT 2015 STMicroelectronics *****END OF FILE****/
